11/data/attachments/10ece52c031e0bd8.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_acb6179a-fa4f-4750-9c56-2d2024dc1ff9</nif:username>
            <nif:friendToBeAdded>Marie_walk_Friend_53996_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>